espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_peri_pms_reg.h
/** PMS_CORE0_UM_HP_PERI_PMS_REG1_REG register
 *  Permission control register1 for HP CPU0 in user mode
 */
#define PMS_CORE0_UM_HP_PERI_PMS_REG1_REG (DR_REG_HP_PERI_PMS_BASE + 0x1c)
/** PMS_CORE0_UM_HP_USBOTG_ALLOW : R/W; bitpos: [0]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP high-speed USB
 *  2.0 OTG.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_USBOTG_ALLOW    (BIT(0))
#define PMS_CORE0_UM_HP_USBOTG_ALLOW_M  (PMS_CORE0_UM_HP_USBOTG_ALLOW_V << PMS_CORE0_UM_HP_USBOTG_ALLOW_S)
#define PMS_CORE0_UM_HP_USBOTG_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_USBOTG_ALLOW_S  0
/** PMS_CORE0_UM_HP_USBOTG11_ALLOW : R/W; bitpos: [1]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP full-speed USB
 *  2.0 OTG.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_USBOTG11_ALLOW    (BIT(1))
#define PMS_CORE0_UM_HP_USBOTG11_ALLOW_M  (PMS_CORE0_UM_HP_USBOTG11_ALLOW_V << PMS_CORE0_UM_HP_USBOTG11_ALLOW_S)
#define PMS_CORE0_UM_HP_USBOTG11_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_USBOTG11_ALLOW_S  1
/** PMS_CORE0_UM_HP_USBOTG11_WRAP_ALLOW : R/W; bitpos: [2]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP full-speed USB
 *  2.0 OTG's wrap.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_USBOTG11_WRAP_ALLOW    (BIT(2))
#define PMS_CORE0_UM_HP_USBOTG11_WRAP_ALLOW_M  (PMS_CORE0_UM_HP_USBOTG11_WRAP_ALLOW_V << PMS_CORE0_UM_HP_USBOTG11_WRAP_ALLOW_S)
#define PMS_CORE0_UM_HP_USBOTG11_WRAP_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_USBOTG11_WRAP_ALLOW_S  2
/** PMS_CORE0_UM_HP_GDMA_ALLOW : R/W; bitpos: [3]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP DW-GDMA.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_GDMA_ALLOW    (BIT(3))
#define PMS_CORE0_UM_HP_GDMA_ALLOW_M  (PMS_CORE0_UM_HP_GDMA_ALLOW_V << PMS_CORE0_UM_HP_GDMA_ALLOW_S)
#define PMS_CORE0_UM_HP_GDMA_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_GDMA_ALLOW_S  3
/** PMS_CORE0_UM_HP_REGDMA_ALLOW : R/W; bitpos: [4]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP REGDMA.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_REGDMA_ALLOW    (BIT(4))
#define PMS_CORE0_UM_HP_REGDMA_ALLOW_M  (PMS_CORE0_UM_HP_REGDMA_ALLOW_V << PMS_CORE0_UM_HP_REGDMA_ALLOW_S)
#define PMS_CORE0_UM_HP_REGDMA_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_REGDMA_ALLOW_S  4
/** PMS_CORE0_UM_HP_SDMMC_ALLOW : R/W; bitpos: [5]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP SDMMC.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_SDMMC_ALLOW    (BIT(5))
#define PMS_CORE0_UM_HP_SDMMC_ALLOW_M  (PMS_CORE0_UM_HP_SDMMC_ALLOW_V << PMS_CORE0_UM_HP_SDMMC_ALLOW_S)
#define PMS_CORE0_UM_HP_SDMMC_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_SDMMC_ALLOW_S  5
/** PMS_CORE0_UM_HP_AHB_PDMA_ALLOW : R/W; bitpos: [6]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access GDMA-AHB.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_AHB_PDMA_ALLOW    (BIT(6))
#define PMS_CORE0_UM_HP_AHB_PDMA_ALLOW_M  (PMS_CORE0_UM_HP_AHB_PDMA_ALLOW_V << PMS_CORE0_UM_HP_AHB_PDMA_ALLOW_S)
#define PMS_CORE0_UM_HP_AHB_PDMA_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_AHB_PDMA_ALLOW_S  6
/** PMS_CORE0_UM_HP_JPEG_ALLOW : R/W; bitpos: [7]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP JPEG.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_JPEG_ALLOW    (BIT(7))
#define PMS_CORE0_UM_HP_JPEG_ALLOW_M  (PMS_CORE0_UM_HP_JPEG_ALLOW_V << PMS_CORE0_UM_HP_JPEG_ALLOW_S)
#define PMS_CORE0_UM_HP_JPEG_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_JPEG_ALLOW_S  7
/** PMS_CORE0_UM_HP_PPA_ALLOW : R/W; bitpos: [8]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP PPA.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_PPA_ALLOW    (BIT(8))
#define PMS_CORE0_UM_HP_PPA_ALLOW_M  (PMS_CORE0_UM_HP_PPA_ALLOW_V << PMS_CORE0_UM_HP_PPA_ALLOW_S)
#define PMS_CORE0_UM_HP_PPA_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_PPA_ALLOW_S  8
/** PMS_CORE0_UM_HP_DMA2D_ALLOW : R/W; bitpos: [9]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP 2D-DMA.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_DMA2D_ALLOW    (BIT(9))
#define PMS_CORE0_UM_HP_DMA2D_ALLOW_M  (PMS_CORE0_UM_HP_DMA2D_ALLOW_V << PMS_CORE0_UM_HP_DMA2D_ALLOW_S)
#define PMS_CORE0_UM_HP_DMA2D_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_DMA2D_ALLOW_S  9
/** PMS_CORE0_UM_HP_KEY_MANAGER_ALLOW : R/W; bitpos: [10]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP key manager.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_KEY_MANAGER_ALLOW    (BIT(10))
#define PMS_CORE0_UM_HP_KEY_MANAGER_ALLOW_M  (PMS_CORE0_UM_HP_KEY_MANAGER_ALLOW_V << PMS_CORE0_UM_HP_KEY_MANAGER_ALLOW_S)
#define PMS_CORE0_UM_HP_KEY_MANAGER_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_KEY_MANAGER_ALLOW_S  10
/** PMS_CORE0_UM_HP_AXI_PDMA_ALLOW : R/W; bitpos: [11]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP GDMA-AXI.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_AXI_PDMA_ALLOW    (BIT(11))
#define PMS_CORE0_UM_HP_AXI_PDMA_ALLOW_M  (PMS_CORE0_UM_HP_AXI_PDMA_ALLOW_V << PMS_CORE0_UM_HP_AXI_PDMA_ALLOW_S)
#define PMS_CORE0_UM_HP_AXI_PDMA_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_AXI_PDMA_ALLOW_S  11
/** PMS_CORE0_UM_HP_FLASH_ALLOW : R/W; bitpos: [12]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP flash MSPI
 *  controller.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_FLASH_ALLOW    (BIT(12))
#define PMS_CORE0_UM_HP_FLASH_ALLOW_M  (PMS_CORE0_UM_HP_FLASH_ALLOW_V << PMS_CORE0_UM_HP_FLASH_ALLOW_S)
#define PMS_CORE0_UM_HP_FLASH_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_FLASH_ALLOW_S  12
/** PMS_CORE0_UM_HP_PSRAM_ALLOW : R/W; bitpos: [13]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP PSRAM MSPI
 *  controller.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_PSRAM_ALLOW    (BIT(13))
#define PMS_CORE0_UM_HP_PSRAM_ALLOW_M  (PMS_CORE0_UM_HP_PSRAM_ALLOW_V << PMS_CORE0_UM_HP_PSRAM_ALLOW_S)
#define PMS_CORE0_UM_HP_PSRAM_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_PSRAM_ALLOW_S  13
/** PMS_CORE0_UM_HP_CRYPTO_ALLOW : R/W; bitpos: [14]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP CRYPTO.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_CRYPTO_ALLOW    (BIT(14))
#define PMS_CORE0_UM_HP_CRYPTO_ALLOW_M  (PMS_CORE0_UM_HP_CRYPTO_ALLOW_V << PMS_CORE0_UM_HP_CRYPTO_ALLOW_S)
#define PMS_CORE0_UM_HP_CRYPTO_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_CRYPTO_ALLOW_S  14
/** PMS_CORE0_UM_HP_GMAC_ALLOW : R/W; bitpos: [15]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP EMAC.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_GMAC_ALLOW    (BIT(15))
#define PMS_CORE0_UM_HP_GMAC_ALLOW_M  (PMS_CORE0_UM_HP_GMAC_ALLOW_V << PMS_CORE0_UM_HP_GMAC_ALLOW_S)
#define PMS_CORE0_UM_HP_GMAC_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_GMAC_ALLOW_S  15
/** PMS_CORE0_UM_HP_USB_PHY_ALLOW : R/W; bitpos: [16]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP high-speed USB
 *  2.0 OTG PHY.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_USB_PHY_ALLOW    (BIT(16))
#define PMS_CORE0_UM_HP_USB_PHY_ALLOW_M  (PMS_CORE0_UM_HP_USB_PHY_ALLOW_V << PMS_CORE0_UM_HP_USB_PHY_ALLOW_S)
#define PMS_CORE0_UM_HP_USB_PHY_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_USB_PHY_ALLOW_S  16
/** PMS_CORE0_UM_HP_PVT_ALLOW : R/W; bitpos: [17]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP PVT.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_CORE0_UM_HP_PVT_ALLOW    (BIT(17))
#define PMS_CORE0_UM_HP_PVT_ALLOW_M  (PMS_CORE0_UM_HP_PVT_ALLOW_V << PMS_CORE0_UM_HP_PVT_ALLOW_S)
#define PMS_CORE0_UM_HP_PVT_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_PVT_ALLOW_S  17
/** PMS_CORE0_UM_HP_CSI_HOST_ALLOW : R/W; bitpos: [18]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP MIPI CSI host.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_CSI_HOST_ALLOW    (BIT(18))
#define PMS_CORE0_UM_HP_CSI_HOST_ALLOW_M  (PMS_CORE0_UM_HP_CSI_HOST_ALLOW_V << PMS_CORE0_UM_HP_CSI_HOST_ALLOW_S)
#define PMS_CORE0_UM_HP_CSI_HOST_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_CSI_HOST_ALLOW_S  18
/** PMS_CORE0_UM_HP_DSI_HOST_ALLOW : R/W; bitpos: [19]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP MIPI DSI host.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_DSI_HOST_ALLOW    (BIT(19))
#define PMS_CORE0_UM_HP_DSI_HOST_ALLOW_M  (PMS_CORE0_UM_HP_DSI_HOST_ALLOW_V << PMS_CORE0_UM_HP_DSI_HOST_ALLOW_S)
#define PMS_CORE0_UM_HP_DSI_HOST_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_DSI_HOST_ALLOW_S  19
/** PMS_CORE0_UM_HP_ISP_ALLOW : R/W; bitpos: [20]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP ISP.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_ISP_ALLOW    (BIT(20))
#define PMS_CORE0_UM_HP_ISP_ALLOW_M  (PMS_CORE0_UM_HP_ISP_ALLOW_V << PMS_CORE0_UM_HP_ISP_ALLOW_S)
#define PMS_CORE0_UM_HP_ISP_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_ISP_ALLOW_S  20
/** PMS_CORE0_UM_HP_H264_CORE_ALLOW : R/W; bitpos: [21]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP H264 Encoder.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_H264_CORE_ALLOW    (BIT(21))
#define PMS_CORE0_UM_HP_H264_CORE_ALLOW_M  (PMS_CORE0_UM_HP_H264_CORE_ALLOW_V << PMS_CORE0_UM_HP_H264_CORE_ALLOW_S)
#define PMS_CORE0_UM_HP_H264_CORE_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_H264_CORE_ALLOW_S  21
/** PMS_CORE0_UM_HP_RMT_ALLOW : R/W; bitpos: [22]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP RMT.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_RMT_ALLOW    (BIT(22))
#define PMS_CORE0_UM_HP_RMT_ALLOW_M  (PMS_CORE0_UM_HP_RMT_ALLOW_V << PMS_CORE0_UM_HP_RMT_ALLOW_S)
#define PMS_CORE0_UM_HP_RMT_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_RMT_ALLOW_S  22
/** PMS_CORE0_UM_HP_BITSCRAMBLER_ALLOW : R/W; bitpos: [23]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP bit scrambler.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_BITSCRAMBLER_ALLOW    (BIT(23))
#define PMS_CORE0_UM_HP_BITSCRAMBLER_ALLOW_M  (PMS_CORE0_UM_HP_BITSCRAMBLER_ALLOW_V << PMS_CORE0_UM_HP_BITSCRAMBLER_ALLOW_S)
#define PMS_CORE0_UM_HP_BITSCRAMBLER_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_BITSCRAMBLER_ALLOW_S  23
/** PMS_CORE0_UM_HP_AXI_ICM_ALLOW : R/W; bitpos: [24]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP AXI ICM.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_AXI_ICM_ALLOW    (BIT(24))
#define PMS_CORE0_UM_HP_AXI_ICM_ALLOW_M  (PMS_CORE0_UM_HP_AXI_ICM_ALLOW_V << PMS_CORE0_UM_HP_AXI_ICM_ALLOW_S)
#define PMS_CORE0_UM_HP_AXI_ICM_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_AXI_ICM_ALLOW_S  24
/** PMS_CORE0_UM_HP_PERI_PMS_ALLOW : R/W; bitpos: [25]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP_PERI_PMS_REG.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_PERI_PMS_ALLOW    (BIT(25))
#define PMS_CORE0_UM_HP_PERI_PMS_ALLOW_M  (PMS_CORE0_UM_HP_PERI_PMS_ALLOW_V << PMS_CORE0_UM_HP_PERI_PMS_ALLOW_S)
#define PMS_CORE0_UM_HP_PERI_PMS_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_PERI_PMS_ALLOW_S  25
/** PMS_CORE0_UM_LP2HP_PERI_PMS_ALLOW : R/W; bitpos: [26]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access
 *  LP2HP_PERI_PMS_REG.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_LP2HP_PERI_PMS_ALLOW    (BIT(26))
#define PMS_CORE0_UM_LP2HP_PERI_PMS_ALLOW_M  (PMS_CORE0_UM_LP2HP_PERI_PMS_ALLOW_V << PMS_CORE0_UM_LP2HP_PERI_PMS_ALLOW_S)
#define PMS_CORE0_UM_LP2HP_PERI_PMS_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_LP2HP_PERI_PMS_ALLOW_S  26
/** PMS_CORE0_UM_DMA_PMS_ALLOW : R/W; bitpos: [27]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access HP_DMA_PMS_REG.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_DMA_PMS_ALLOW    (BIT(27))
#define PMS_CORE0_UM_DMA_PMS_ALLOW_M  (PMS_CORE0_UM_DMA_PMS_ALLOW_V << PMS_CORE0_UM_DMA_PMS_ALLOW_S)
#define PMS_CORE0_UM_DMA_PMS_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_DMA_PMS_ALLOW_S  27
/** PMS_CORE0_UM_HP_H264_DMA2D_ALLOW : R/W; bitpos: [28]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access 2D-DMA.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_HP_H264_DMA2D_ALLOW    (BIT(28))
#define PMS_CORE0_UM_HP_H264_DMA2D_ALLOW_M  (PMS_CORE0_UM_HP_H264_DMA2D_ALLOW_V << PMS_CORE0_UM_HP_H264_DMA2D_ALLOW_S)
#define PMS_CORE0_UM_HP_H264_DMA2D_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_HP_H264_DMA2D_ALLOW_S  28
/** PMS_CORE0_UM_AXI_PERF_MON_ALLOW : R/W; bitpos: [29]; default: 1;
 *  Configures whether HP CPU0 in user mode has permission to access AXI PERFMON.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE0_UM_AXI_PERF_MON_ALLOW    (BIT(29))
#define PMS_CORE0_UM_AXI_PERF_MON_ALLOW_M  (PMS_CORE0_UM_AXI_PERF_MON_ALLOW_V << PMS_CORE0_UM_AXI_PERF_MON_ALLOW_S)
#define PMS_CORE0_UM_AXI_PERF_MON_ALLOW_V  0x00000001U
#define PMS_CORE0_UM_AXI_PERF_MON_ALLOW_S  29

