espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_peri_pms_reg.h
/** PMS_CORE1_UM_HP_PERI_PMS_REG3_REG register
 *  Permission control register3 for HP CPU1 in user mode
 */
#define PMS_CORE1_UM_HP_PERI_PMS_REG3_REG (DR_REG_HP_PERI_PMS_BASE + 0x44)
/** PMS_CORE1_UM_HP_GPIO_ALLOW : R/W; bitpos: [0]; default: 1;
 *  Configures whether HP CPU1 in user mode has permission to access HP GPIO Matrix.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE1_UM_HP_GPIO_ALLOW    (BIT(0))
#define PMS_CORE1_UM_HP_GPIO_ALLOW_M  (PMS_CORE1_UM_HP_GPIO_ALLOW_V << PMS_CORE1_UM_HP_GPIO_ALLOW_S)
#define PMS_CORE1_UM_HP_GPIO_ALLOW_V  0x00000001U
#define PMS_CORE1_UM_HP_GPIO_ALLOW_S  0
/** PMS_CORE1_UM_HP_IOMUX_ALLOW : R/W; bitpos: [1]; default: 1;
 *  Configures whether HP CPU1 in user mode has permission to access HP IO MUX.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE1_UM_HP_IOMUX_ALLOW    (BIT(1))
#define PMS_CORE1_UM_HP_IOMUX_ALLOW_M  (PMS_CORE1_UM_HP_IOMUX_ALLOW_V << PMS_CORE1_UM_HP_IOMUX_ALLOW_S)
#define PMS_CORE1_UM_HP_IOMUX_ALLOW_V  0x00000001U
#define PMS_CORE1_UM_HP_IOMUX_ALLOW_S  1
/** PMS_CORE1_UM_HP_SYSTIMER_ALLOW : R/W; bitpos: [2]; default: 1;
 *  Configures whether HP CPU1 in user mode has permission to access HP system timer.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE1_UM_HP_SYSTIMER_ALLOW    (BIT(2))
#define PMS_CORE1_UM_HP_SYSTIMER_ALLOW_M  (PMS_CORE1_UM_HP_SYSTIMER_ALLOW_V << PMS_CORE1_UM_HP_SYSTIMER_ALLOW_S)
#define PMS_CORE1_UM_HP_SYSTIMER_ALLOW_V  0x00000001U
#define PMS_CORE1_UM_HP_SYSTIMER_ALLOW_S  2
/** PMS_CORE1_UM_HP_SYS_REG_ALLOW : R/W; bitpos: [3]; default: 1;
 *  Configures whether HP CPU1 in user mode has permission to access HP system
 *  register.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE1_UM_HP_SYS_REG_ALLOW    (BIT(3))
#define PMS_CORE1_UM_HP_SYS_REG_ALLOW_M  (PMS_CORE1_UM_HP_SYS_REG_ALLOW_V << PMS_CORE1_UM_HP_SYS_REG_ALLOW_S)
#define PMS_CORE1_UM_HP_SYS_REG_ALLOW_V  0x00000001U
#define PMS_CORE1_UM_HP_SYS_REG_ALLOW_S  3
/** PMS_CORE1_UM_HP_CLKRST_ALLOW : R/W; bitpos: [4]; default: 1;
 *  Configures whether HP CPU1 in user mode has permission to access HP_SYS_CLKRST.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_CORE1_UM_HP_CLKRST_ALLOW    (BIT(4))
#define PMS_CORE1_UM_HP_CLKRST_ALLOW_M  (PMS_CORE1_UM_HP_CLKRST_ALLOW_V << PMS_CORE1_UM_HP_CLKRST_ALLOW_S)
#define PMS_CORE1_UM_HP_CLKRST_ALLOW_V  0x00000001U
#define PMS_CORE1_UM_HP_CLKRST_ALLOW_S  4

/** PMS_REGDMA_HP_PERI_PMS_REG register
 *  HP Peripheral Permission register for REGDMA
 */
#define PMS_REGDMA_HP_PERI_PMS_REG (DR_REG_HP_PERI_PMS_BASE + 0x48)
/** PMS_REGDMA_PERI_HP_PERI_ALLOW : R/W; bitpos: [0]; default: 1;
 *  Configures whether REGDMA has permission to access  all HP peripherals.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_REGDMA_PERI_HP_PERI_ALLOW    (BIT(0))
#define PMS_REGDMA_PERI_HP_PERI_ALLOW_M  (PMS_REGDMA_PERI_HP_PERI_ALLOW_V << PMS_REGDMA_PERI_HP_PERI_ALLOW_S)
#define PMS_REGDMA_PERI_HP_PERI_ALLOW_V  0x00000001U
#define PMS_REGDMA_PERI_HP_PERI_ALLOW_S  0

#ifdef __cplusplus
}
#endif
